"""Даны натуральное число n и целые числа a1, a2, …, an,
среди которых имеются числа, равные 10. Найти:
а) номер последнего из них;
б) номер первого из них."""
n = int(input('Введите количество элементов a для ввода: '))
for i in range(1,n+1):
    print("Введите элемент A",i,": ")
    a = int(input())
    if a == 10:
        countA = i
        break #break для буквы б)
print(countA)
